export const testAnswers = [
  {
    answer: [1,2],
    question: 'Что такое Angular?',
    answerText: 'Angular.JS — это фреймворк для работы с JavaScript'
  },
  {
    answer: 3,
    question: 'Для чего используется Angular?',
    answerText: 'Создание одностраничных приложений'
  },
  {
    answer: [1,3,4,5],
    question: 'Укажите правильные утверждения по поводу директив в Angular 8:',
    answerText: 'директива – это обычный класс, написанный на typescript, к которому применяется декоратор Directive; директивы предназначены для изменения структуры DOM-дерева;директивы предназначены для изменения внешнего вида или поведения по-умолчанию элемента DOM-дерева; ngFor – это структурная директива'
  },
  {
    answer: [2,3,4],
    question: 'Директива в Angular может содержать:',
    answerText: 'несколько Input’ов и один selector; несколько селекторов, перечисленных через запятую; в селекторе элемент input c атрибутами как целевой элемент HTML'
  },
  {
    answer: 3,
    question: 'В чем разница между AngularJS и Angular?',
    answerText: 'Первый является фреймворком, а второй то же самое, но с многими преимуществами'
  },
  {
    answer: [3, 4],
    question: 'Укажите правильные утверждения, касающиеся привязки данных в Angular:',
    answerText: 'в Angular существует три односторонних привязки данных; в Angular существует одна двусторонняя привязка данных'
  },
  {
    answer: 1,
    question: 'Декоратор HostListener применяется в случаях, если:',
    answerText: 'необходимо связать события DOM и методы директивы для изменения стандартного поведения DOM-элемента при возникновении пользовательского события'
  },
  {
    answer: 2,
    question: 'C помощью декоратора @Input() можно:',
    answerText: '.once'
  },
  {
    answer: [1,2,4,5],
    question: 'Отметьте хуки жизненного цила Vue по очерёдности вызова',
    answerText: 'хранение данных в памяти; хранение глобального состояния приложения; получения данных из какого-либо источника данных; инкапсулирование бизнес-логики для решения проблемы повторения кода, если необходимо выполнить одну и ту же задачу в разных компонентах и классах'
  },
  {
    answer: 4,
    question: 'В чем разница между директивами show и if?',
    answerText: 'Все варианты ответов верны'
  },
  {
    answer: [2, 3, 6],
    question: 'Выберите модификаторы клавиш мыши',
    answerText: 'Есть только 3 модификатора: left, right, middle'
  },
  {
    answer: 8,
    question: 'Сколько в Angular представлено нативных конструкторов типов?',
    answerText: 'String, Number, Boolean, Array, Object, Date, Function, Symbol - 8 штук'
  },
  {
    answer: 3,
    question: 'Отметьте неправильный пример использования директивы v-for',
    answerText: 'v-for="let item in items" - так писать нельзя'
  },
  {
    answer: [1, 2, 4],
    question: 'Что верно относительно совместного использования директив v-for и v-if?',
    answerText: 'Не рекомендуется их совместное использование; v-if имеет больший приоритет, чем v-for; В условии v-if не будет доступа к переменным из области видимости v-for'
  },
  {
    answer: 7,
    question: 'Какой из перечисленных методов массивов не запускет обновление отображения',
    answerText: 'concat'
  },
  {
    answer: [2,3,6,9],
    question: 'Укажите правильные утверждения, характерные для паттерна Observer в JavaScript:',
    answerText: 'Все, кроме 1,4-5,7-8,10 варианта ответа'
  },
  {
    answer: 5,
    question: 'Какая передача props в качестве входных параметров недопустима',
    answerText: 'Всё допустимо'
  },
  {
    answer: [1, 2, 3, 5],
    question: 'В каких случаях при передаче boolean свойства оно примет значение true?',
    answerText: 'Указание свойства, пустая строка, значение свойства в kebab-case и передача true'
  },
  {
    answer: 4,
    question: 'С какой версии Angular основные версии ядра Angular и CLI согласованы?',
    answerText: 'Angular 7'
  },
  {
    answer: 1,
    question: 'В чём заключается смысл однофайлового компонента?',
    answerText: 'Один такой компонент с его шаблоном, скриптом и стилями находится в одном файле'
  }
];

// nineth на порядок