<template>
  <v-row justify="center" align="center">
    <v-col cols="12">
      <v-card>
            <div>
              <h2 class="mt-6">Обзор CLI и Ссылка на команду </h2>
              <v-divider class="mb-6" />
              <p>Angular CLI - это инструмент интерфейса командной строки, который используется для инициализации, разработки, сборки и обслуживания приложений Angular. Вы можете использовать инструмент непосредственно в командной оболочке или косвенно через интерактивный пользовательский интерфейс, такой как Angular Console.</p>
            </div>
          </div>

          <div>
            <h2 class="mt-6">Установка Angular CLI</h2>
            <v-divider class="mb-6" />
            <p>
              Основные версии Angular CLI следуют за поддерживаемой основной версией Angular, но второстепенные версии могут быть выпущены отдельно.</p>
            <p>Установите CLI с помощью менеджера пакетов npm:</p>
            <p><div class="language-html line-numbers-mode">
              <pre
                class="language-html"
              ><span class="pln">npm install </span><span class="pun">-</span><span class="pln">g </span><span class="lit">@angular</span><span class="pun">/</span><span class="pln">cli</span>
              
</span>  
</span>
</code></pre>
            </div>
            <p>Для получения подробной информации об изменениях между версиями и информации об обновлении с предыдущих выпусков смотрите вкладку Выпуски на GitHub: https://github.com/angular/angular-cli/releases</p>
          </div>

          <div>
            <h2 class="mt-6">Базовый рабочий процесс</h2>
            <v-divider class="mb-6" />
            <p>
              Вызовите инструмент в командной строке через исполняемый файл ng. Интерактивная справка доступна в командной строке. Введите следующее, чтобы перечислить команды или опции для данной команды (например, сгенерировать) с кратким описанием.
            </p>
            <p><div class="language-html line-numbers-mode">
              <pre
                class="language-html"
              ><span class="pln">ng help
ng generate </span><span class="pun">--</span><span class="pln">help</span>
              
</span>  
</span>
</code></pre>
            </div>
           <p>Чтобы создать, компоновать и обслуживать новый базовый проект Angular на сервере разработки, перейдите в родительский каталог вашей новой рабочей области, используя следующие команды:</p>
         <p><div class="language-html line-numbers-mode">
              <pre
                class="language-html"
              ><span class="pln">ng new my</span><span class="pun">-</span><span class="pln">first</span><span class="pun">-</span><span class="pln">project
cd my</span><span class="pun">-</span><span class="pln">first</span><span class="pun">-</span><span class="pln">project
ng serve</span>
              
</span>  
</span>
</code></pre>
            </div>
            <p>В вашем браузере откройте http://localhost:4200 / чтобы увидеть запуск нового приложения. Когда вы используете команду ng serve для создания приложения и его локального обслуживания, сервер автоматически перестраивает приложение и перезагружает страницу при изменении любого из исходных файлов.</p>
          </div>

          <div>
            <h2 class="mt-6">Рабочие области и файлы проекта</h2>
            <v-divider class="mb-6" />
            <p>Команда ng new создает папку Angular workspace и генерирует новый скелет приложения. Рабочее пространство может содержать несколько приложений и библиотек. Первоначальное приложение, созданное командой ng new, находится на верхнем уровне рабочей области. Когда вы создаете дополнительное приложение или библиотеку в рабочей области, они попадают в проекты/ подпапку.</p>
            <p>Недавно сгенерированное приложение содержит исходные файлы для корневого модуля с корневым компонентом и шаблоном. У каждого приложения есть папка src, которая содержит логику, данные и ресурсы.</p>
            <p>Вы можете редактировать сгенерированные файлы напрямую или добавлять к ним и изменять их с помощью команд CLI. Используйте команду ng generate для добавления новых файлов для дополнительных компонентов и служб, а также кода для новых каналов, директив и так далее. Такие команды, как add и generate, которые создают приложения и библиотеки или работают с ними, должны выполняться из рабочей области или папки проекта.<br>
            · Смотрите больше о файловой структуре рабочей области.</p>
        
          </div>

          <div>
            <h2 class="mt-6">Конфигурация рабочего пространства и проекта</h2>
            <v-divider class="mb-6" />
            <p>
              Единый файл конфигурации рабочей области, angular.json, создается на верхнем уровне рабочей области. Здесь вы можете установить параметры команд CLI по умолчанию для каждого проекта и указать конфигурации, которые будут использоваться, когда CLI создает проект для разных целей.
    
            </p>
            <p>Команда ng config позволяет вам устанавливать и извлекать значения конфигурации из командной строки, или вы можете редактировать файл angular.json напрямую. Обратите внимание, что имена опций в файле конфигурации должны использовать camelCase, в то время как имена опций, предоставляемые командам, могут использовать либо camelCase, либо dash-case.</p>
            <p>· Смотрите больше о конфигурации рабочей области.<br>
            · Смотрите полную схему для angular.json.</p>
            
          </div>

          <div>
            <h2 class="mt-6">Синтаксис командного языка CLI</h2>
            <v-divider class="mb-6" />
            <p>
              Синтаксис команды показан следующим образом:
            </p>
            <p>ng имякоманды или требуемые параметры [optionalArg] [options]<br>

· Большинство команд и некоторые параметры имеют псевдонимы. Псевдонимы указаны в инструкции синтаксиса для каждой команды.

<br>· Названия опций предваряются двойным тире (--). Псевдонимы опций предваряются одним тире (-). Аргументы не имеют префикса. Например:</p>
            <p>· Как правило, имя сгенерированного артефакта может быть задано в качестве аргумента команде или указано с помощью параметра --name.

<br>· Имена аргументов и опций могут быть указаны либо в camelCase, либо в dash-case. --myOptionName эквивалентно --my-option-name.</p>
            <p><div class="language-html line-numbers-mode">
              <pre
                class="language-html"
              ><span class="pln">ng build my</span><span class="pun">-</span><span class="pln">app </span><span class="pun">-</span><span class="pln">c production</span>
              
</span>  
</span>
</code></pre>
            </div>
          </div>

          

          <v-btn
            class="mt-6"
            color="success"
            nuxt
            to="/guide/2.2 usage"
          >
            Слудующий раздел
          </v-btn>
        </v-sheet>
      </v-card>
    </v-col>
  </v-row>
</template>

<script>
import SuccessAlert from "~/components/SuccessAlert.vue";

export default {
  name: "GuideIntroduction",
  components: { SuccessAlert },
};
</script>

