<template>
  <v-row justify="center" align="center">
    <v-col cols="12">
      <v-card>

            <div>
              <h2 class="mt-6">Маршрутизация</h2>
              <v-divider class="mb-6" />
              <p>После прохождения раздела Ваше первое приложение в Интернет-магазине появился каталог основных товаров. В приложении еще нет переменных состояний или навигации. Есть только URL-адрес, на котором всегда отображается страница "Мой магазин" со списком товаров и их описанием.</p>
              <p>В этом разделе приложение пополнится отдельными страницами с отдельными URL-адресами с описанием товаров.</p>
              <p>Для этого используйте router. Обработчик маршрутов Angular позволит представить разные компоненты и данные пользователю на основе того, где он находится. Обработчик маршрутов дает возможность переходить от одного представления к другому при выполнении разных задач:

               <br> <br>· Введите URL в адресную строку, и браузер отобразит соответствующую страницу.
                <br>· Нажмите на ссылки на странице для перехода на новую страницу в браузере.
                <br>· Нажмите стрелки назад и вперед в панели браузера, браузер отреагирует переходом на соответствующие страницы по истории просмотра страниц.</p>
            </div>
          </div>

          <div>
            <h2 class="mt-6">Регистрация маршрута</h2>
            <v-divider class="mb-6" />
            <p>
              Приложение уже настроено на использование обработчика маршрутов Angular и маршрутизации для навигации по компоненту списка товаров, который Вы ранее изменили. Определим маршрут для отображения детальной информации по определенному товару.
            </p>
            <p>1. Сгенерируйте новый компонент для детальной информации о товаре с названием product-details.

                <br>Напоминание: в списке файлов кликните правой кнопкой мыши на папку app, выберите Angular Generator и Component.</p>
            <p>2. В app.module.ts добавьте маршрут для детальной информации о товаре с path products/:productId и ProductDetailsComponent для component.</p>
            <div class="d-flex justify-left">
            <v-img max-width="604" :src="image1" />
           </div>
            <p>Маршрут связывает один или более путей URL-адреса с компонентом.</p>
            <p>3. Определите ссылку при помощи директивы RouterLink. routerLink декларативно определяет, каким образом пользователь переходит к роутингу (или URL-адресу) в шаблоне компонента.

                <br>Мы хотим, чтобы пользователь нажал на название товара для отображения подробной информации по данному товару.</p>
          <p>3.1 Откройте product-list.component.html.

            <br>3.2 Обновите директиву *ngFor для присвоения переменной productId значения индекса каждого элемента массива products при прохождении по списку.

            <br>3.3 Измените ссылку названия товара для включения routerLink.</p>
            <div class="d-flex justify-left">
            <v-img max-width="585" :src="image2" />
           </div>
           <p>Директива RouterLink дает обработчику маршрутов контроль над ссылкой. В этом случае маршрут (URL-адрес) содержит один фиксированный элемент (/products), а финальный сегмент является переменной, которая вставляет свойство id выделенного товара. Например, URL-адрес для товара с id 1 аналогичен https://getting-started-myfork.stackblitz.io/products/1.</p>
            <p>4. Протестируйте обработчик маршрутов, кликните на название товара. Приложение отобразит компонент с подробной информацией о товаре. Отображается "компонент с подробной информацией о товарах работает!" (Мы исправим это в следующем разделе)
                

            <br>Обратите внимание, что URL-адрес в окне предварительного просмотра поменялся. Финальный сегмент - products/1.</p>          
          <div class="d-flex justify-center">
              <v-img
                class="mb-4"
                max-width="259"
                height="162"
                src="https://angular-doc.ru/generated/images/guide/start/product-details-works.png"
              />
            </div>
          </div>

          <div>
            <h2 class="mt-6">Использование информации о маршруте</h2>
            <v-divider class="mb-6" />
            <p>
              Компонент с подробной информацией о товарах управляет представлением каждого товара. Обработчик событий Angular отображает компоненты по URL-адресу браузера и заданным маршрутам. Используйте Angular Router для объеденения данных о товарах и информации о маршруте, чтобы отобразить детальную информации по каждому товару.
            </p>
            <p>1. Откройте product-details.component.ts</p>
            <p>2. Настройте использование данных о товаре с внешнего файла.</p>
                </p>2.1 Товары в списке должны отображаться одинаково, друг за другом на странице. 
                Для этого воспользуйтесь директивой *ngFor. Установите директиву *ngFor на <code>&lt;div></code>, как представлено ниже:</p>
            
            <p>2.1 Импортируйте ActivatedRoute из пакета @angular/router, а набор products - из ../products.</p>
            <div class="d-flex justify-left">
            <v-img max-width="436" :src="image3" />
           </div>
           
            <p>
              2.2 Определите свойства product и вставьте ActivatedRoute в конструктор.
            </p>
            <div class="d-flex justify-left">
            <v-img max-width="486" :src="image4" />
           </div>
            <p>ActivatedRoute специфичен для каждого компонента, загружаемого Angular Router. Он содержит информацию о маршруте, его параметрах и дополнительные данные, связанные с маршрутом.</p>
             
          <p>3. В методе ngOnInit() подпишитесь на параметры маршрута и получите товар через productId.</p>
          <div class="d-flex justify-left">
            <v-img max-width="500" max-height="138" :src="image5" />
           </div>
            <p>Параметры маршрута соотносятся с переменными пути, определенными в маршруте. productId возвращается из URL-адреса, который совпадает с маршрутом. Используйте productId для отображения детальной информации по каждому уникальному товару.</p>
           <p>4. Обновите шаблон для отображения подробной информации о товарах внутри *ngIf.</p>
           <div class="d-flex justify-left">
            <v-img max-width="435" max-height="210" :src="image6" />
           </div>
           <p>Сейчас при нажатии на название товара в списке товаров обработчик маршрутов перенаправляет Вас по соответствующему URL-адресу товара, меняет компонент списка товаров на компонент с подробной информацией о товаре, и отображает подробную информацию о товаре.</p>
          <div class="d-flex justify-center">
              <v-img
                class="mb-4"
                max-width="259"
                height="225"
                src="https://angular-doc.ru/generated/images/guide/start/product-details-routed.png"
              />
            </div>
         
          </div>

         

          <v-btn
            class="mt-6"
            color="success"
            nuxt
            to="/guide/4 razvr"
          >
            Следующий раздел
          </v-btn>
        </v-sheet>
      </v-card>
    </v-col>
  </v-row>
</template>

<script>
import SuccessAlert from "~/components/SuccessAlert.vue";

export default {
  name: "GuideIntroduction",
  components: { SuccessAlert },
};
</script>

<script>
import image1 from '~/assets/rout/ro1.png';
import image2 from '~/assets/rout/ro2.png';
import image3 from '~/assets/rout/ro3.png';
import image4 from '~/assets/rout/ro4.png';
import image5 from '~/assets/rout/ro5.png';
import image6 from '~/assets/rout/ro6.png';


export default {
  name: "CodeScreen",
  data() {
    return {
      image1,
      image2,
      image3,
      image4,
      image5,
      image6

    }
  }
};
</script>