<template>
  <v-row justify="center" align="center">
    <v-col cols="12">
      <v-card>
            <div>
              <h2 class="mt-6">Развертывание приложения</h2>
              <v-divider class="mb-6" />
              <p>Чтобы развернуть приложение, нужно его скомпилировать, а затем разместить на веб-сервере JavaScript, CSS и HTML. Приложения на фреймворке Angular легко переносимы, могут работать в любой среде и с любыми технологиями, например, Node, Java, .NET, PHP и многими другими.</p>
              <SuccessAlert>
                Неважно, попали ли Вы в этот раздел непосредственно из Основы работы: Ваше первое приложение или уже создали Интернет-магазина на основе разделов Маршрутизация, Управление данными и Формы, сейчас у Вас есть приложение, которое можно развернуть, если следовать инструкциям этого раздела.
              </SuccessAlert>
            </div>
          </div>

          <div>
            <h2 class="mt-6">Поделитесь своим приложением</h2>
            <v-divider class="mb-6" />
            <p>Проекты на StackBlitz по умолчанию становятся общедоступными, тем самым вы можете поделиться своим приложением Angular через URL проекта. Помните, что такой вариант подходит, если Вы хотите делиться идеями и прототипами, но эта платформа не для хостинга рабочего приложения.</p>
          <p>1. В проекте на StackBlitz удостоверьтесь, что Вы сохранили свой проект.
            <br>2. В области предварительного просмотра можно видеть URL-адрес, например, вот такой https://<code>&lt;Project ID></code>.stackblitz.io.
            <br>3. Поделитесь этим адресом со своими друзьями и коллегами.
            <br>4. Пользователи этой страницы сначала увидят процесс запуска сервера разработки, а затем начнет подгружаться Ваше приложение.</p>
          </div>

          <div>
            <h2 class="mt-6">Сборка приложения в локальной среде</h2>
            <v-divider class="mb-6" />
            <p>
              Чтобы собрать приложение в локальной среде или для внешнего использования, нужно скачать исходный код с Вашего проекта на StackBlitz. Нажмите на иконку Download Project слева от значка Project для скачивания файлов.
            </p>
            <p>Как только файлы скачены и разархивированы, воспользуйтесь Консолью фреймворка Angular для работы с приложением или установите Node.js и запустите Angular CLI.</p>
            <p>С терминала установите Angular CLI глобально:</p>
            
            <p><div class="language-html line-numbers-mode">
              <pre
                class="language-html"
              ><span class="pln">npm install </span><span class="pun">-</span><span class="pln">g </span><span class="lit">@angular</span><span class="pun">/</span><span class="pln">cli</span>
</span>  
</span>
</code></pre>
            </div>
           
            <p>
              В системе установится команда ng для создания нового рабочего пространства, новых проектов, для работы с приложением при разработке, или создания сборок, которыми можно делиться или распространять.
            </p>
            <p>Чтобы создать новое рабочее пространство, в командной строке Angular запустите команду ng new:</p>
            <p><div class="language-html line-numbers-mode">
              <pre
                class="language-html"
              ><span class="pln">ng new my</span><span class="pun">-</span><span class="pln">project</span><span class="pun">-</span><span class="pln">name</span>
</span>  
</span>
</code></pre>
            </div>
            <p>Вы получите файлы для развертывания.</p>
             
          </div>

          <div>
            <h2 class="mt-6">Размещение готового проекта</h2>
            <v-divider class="mb-6" />
            <p>УФайлы в папке dist/my-project-name статичны и могут быть размещены на любом сервере, который поддерживает файлы (Node.js, Java, .NET), и на любых платформах (Firebase, Google Cloud, App Engine, другие).</p>
            
          </div>

          <div>
            <h2 class="mt-6">Размещение приложения Angular на платформе Firebase</h2>
            <v-divider class="mb-6" />
            <p>
              Один из самых простых способов «оживить» Ваш сайт – разместить его на платформе Firebase.
            </p>
            <p>
             1. Зарегистрируйтесь на платформе Firebase.
             <br>2. Создайте новый проект, назовите его.
             <br>3. Установите интерфейс командной строки firebase-tools для развертывания приложения с помощью команды npm install -g firebase-tools.
             <br>4. Свяжите командную строку с учетной записью в Firebase и с проектом с помощью firebase login и firebase init.
             <br>5. Следуйте указаниям при выборе проекта Firebase для размещения.
             <br>6. Разверните приложение с помощью команды firebase deploy, т.к. StackBlitz уже создал firebase.json, который подсказывает платформе Firebase, как работать с Вашим приложением.
             <br>7. Когда приложение развернуто, посмотрите, как оно работает на странице https://your-firebase-project-name.firebaseapp.com!
            </p>

          </div>

          <div>
            <h3 class="my-6">Размещение приложения Angular в другом месте</h3>
            <p>
              Для размещения приложения Angular на другом хостинге Вам нужно подгрузить или отправить файлы на хостинг-платформу. Поскольку Вы собираете одностраничное приложение, удостоверьтесь, что нерабочие URL-ссылки перенаправлены на файл index.html. Подробнее о разработке и распространении Вашего приложения в руководствах Сборка и обслуживание и Развертывание.
            </p>
            
          </div>

          <v-btn
            class="mt-6"
            color="success"
            nuxt
            to="/guide/5 manage"
          >
            Следующий раздел
          </v-btn>
        </v-sheet>
      </v-card>
    </v-col>
  </v-row>
</template>

<script>
import SuccessAlert from "~/components/SuccessAlert.vue";

export default {
  name: "GuideIntroduction",
  components: { SuccessAlert },
};
</script>

